espressif/esp-matter/examples/stateful_light_switch/sdkconfig.defaults.esp32c61
CONFIG_IDF_TARGET="esp32c61"

# ESP Ringbuf
CONFIG_RINGBUF_PLACE_FUNCTIONS_INTO_FLASH=y
CONFIG_RINGBUF_PLACE_ISR_FUNCTIONS_INTO_FLASH=y
# FreeRTOS
CONFIG_FREERTOS_PLACE_FUNCTIONS_INTO_FLASH=y
CONFIG_FREERTOS_PLACE_SNAPSHOT_FUNS_INTO_FLASH=y

CONFIG_ESP_SECURE_CERT_DS_PERIPHERAL=n
